# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
ser1 = pd.Series(np.random.randint(1, 5, size=100))
ser2 = pd.Series(np.random.randint(1, 4, size=100))
ser3 = pd.Series(np.random.randint(10000, 30001, size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [10]:
df = pd.DataFrame({'ser1':ser1, 'ser2':ser2, 'ser3':ser3})

In [36]:
housemarket = pd.concat([ser1, ser2, ser3], axis=1)

In [37]:
housemarket

    0  1      2
0   4  2  12979
1   2  2  14102
2   2  3  21682
3   3  2  27825
4   4  2  21639
.. .. ..    ...
95  2  1  20777
96  2  2  18125
97  3  2  24726
98  3  2  27519
99  2  3  25937

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [13]:
df = df.rename(columns={'ser1': 'bedrs', 'ser2': 'bathrs', 'ser3': 'price_sqr_meter'})

In [14]:
df

    bedrs  bathrs  price_sqr_meter
0       4       2            12979
1       2       2            14102
2       2       3            21682
3       3       2            27825
4       4       2            21639
..    ...     ...              ...
95      2       1            20777
96      2       2            18125
97      3       2            24726
98      3       2            27519
99      2       3            25937

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [56]:
bigcolumn = pd.concat([ser1, ser2, ser3], axis=0)

In [57]:
bigcolumn = bigcolumn.to_frame()

In [58]:
bigcolumn

        0
0       4
1       2
2       2
3       3
4       4
..    ...
95  20777
96  18125
97  24726
98  27519
99  25937

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [59]:
bigcolumn.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [60]:
bigcolumn.reset_index(drop=True, inplace=True)

In [61]:
bigcolumn

         0
0        4
1        2
2        2
3        3
4        4
..     ...
295  20777
296  18125
297  24726
298  27519
299  25937

[300 rows x 1 columns]